In [2]:
import pandas as pd

In [25]:
data1 = {
"Name": ["Ali","Sara","John"],
"Age": [21,22,23],
"Marks": [85,90,88],
"subjects":['Maths','CS','DSA']
}
df1=pd.DataFrame(data1)

In [4]:
df1

   Name  Age  Marks subjects
0   Ali   21     85    Maths
1  Sara   22     90       CS
2  John   23     88      DSA

In [26]:
data2=[
    ['Gojo',35,'JJK','NewGen'],
    ['Sanji',30,'OnePiece','Big3'],
    ['Vegeta',40,'Dragon Ball','Master piece'],
    ['L',20,'Death note',None],
    ['Aizen',40,'Bleach','Big3']
]
df1=pd.DataFrame(data2)
df1

        0   1            2             3
0    Gojo  35          JJK        NewGen
1   Sanji  30     OnePiece          Big3
2  Vegeta  40  Dragon Ball  Master piece
3       L  20   Death note          None
4   Aizen  40       Bleach          Big3

In [29]:
columns_dat2=['name','Age','Anime Name','Ranking']
df2=pd.DataFrame(data2,columns=columns_dat2)
df2

     name  Age   Anime Name       Ranking
0    Gojo   35          JJK        NewGen
1   Sanji   30     OnePiece          Big3
2  Vegeta   40  Dragon Ball  Master piece
3       L   20   Death note          None
4   Aizen   40       Bleach          Big3

In [9]:
df2['Anime Name']

0            JJK
1       OnePiece
2    Dragon Ball
3     Death note
4         Bleach
Name: Anime Name, dtype: object

In [10]:
df2[["name","Ranking"]]

     name       Ranking
0    Gojo        NewGen
1   Sanji          Big3
2  Vegeta  Master piece
3       L          None
4   Aizen          Big3

In [ ]:
# creatin g a new column

In [30]:
df2["theme"]=['Action','Mistory & Adventure','Action Story','Crime','Bankei']
df2

     name  Age   Anime Name       Ranking                theme
0    Gojo   35          JJK        NewGen               Action
1   Sanji   30     OnePiece          Big3  Mistory & Adventure
2  Vegeta   40  Dragon Ball  Master piece         Action Story
3       L   20   Death note          None                Crime
4   Aizen   40       Bleach          Big3               Bankei

In [ ]:
# remove column

In [14]:
df2.drop('Age',axis=1) #1 is column y-axis, 0 ->axis

     name   Anime Name       Ranking                theme
0    Gojo          JJK        NewGen               Action
1   Sanji     OnePiece          Big3  Mistory & Adventure
2  Vegeta  Dragon Ball  Master piece         Action Story
3       L   Death note          None                Crime
4   Aizen       Bleach          Big3               Bankei

In [31]:
df2

     name  Age   Anime Name       Ranking                theme
0    Gojo   35          JJK        NewGen               Action
1   Sanji   30     OnePiece          Big3  Mistory & Adventure
2  Vegeta   40  Dragon Ball  Master piece         Action Story
3       L   20   Death note          None                Crime
4   Aizen   40       Bleach          Big3               Bankei

In [28]:
df2

     name   Anime Name       Ranking                theme
0    Gojo          JJK        NewGen               Action
1   Sanji     OnePiece          Big3  Mistory & Adventure
2  Vegeta  Dragon Ball  Master piece         Action Story
3       L   Death note          None                Crime
4   Aizen       Bleach          Big3               Bankei

In [32]:
df2.drop('Age',axis=1,inplace=True) # delete from original ata also

In [33]:
df2

     name   Anime Name       Ranking                theme
0    Gojo          JJK        NewGen               Action
1   Sanji     OnePiece          Big3  Mistory & Adventure
2  Vegeta  Dragon Ball  Master piece         Action Story
3       L   Death note          None                Crime
4   Aizen       Bleach          Big3               Bankei

In [38]:
df2.drop(['Ranking','theme'],axis=1)

     name   Anime Name
0    Gojo          JJK
1   Sanji     OnePiece
2  Vegeta  Dragon Ball
3       L   Death note
4   Aizen       Bleach

In [39]:
df2

     name   Anime Name       Ranking                theme
0    Gojo          JJK        NewGen               Action
1   Sanji     OnePiece          Big3  Mistory & Adventure
2  Vegeta  Dragon Ball  Master piece         Action Story
3       L   Death note          None                Crime
4   Aizen       Bleach          Big3               Bankei

In [ ]:
# delete a row of L

In [40]:
df2.drop(3,axis =0)

     name   Anime Name       Ranking                theme
0    Gojo          JJK        NewGen               Action
1   Sanji     OnePiece          Big3  Mistory & Adventure
2  Vegeta  Dragon Ball  Master piece         Action Story
4   Aizen       Bleach          Big3               Bankei

In [ ]:
# Accesing rows

In [41]:
df2.loc[0]

name            Gojo
Anime Name       JJK
Ranking       NewGen
theme         Action
Name: 0, dtype: object

In [ ]:
# Accesing a mutiple columns

In [45]:
df2.loc[[0,4]]

    name Anime Name Ranking   theme
0   Gojo        JJK  NewGen  Action
4  Aizen     Bleach    Big3  Bankei

In [47]:
df2.iloc[4]

name           Aizen
Anime Name    Bleach
Ranking         Big3
theme         Bankei
Name: 4, dtype: object

In [ ]:
# selecting subsets of rows and columns

In [49]:
df2.iloc[[0,1]][["name","Ranking"]]

    name Ranking
0   Gojo  NewGen
1  Sanji    Big3

In [53]:
df2.iloc[[0,1,4]][["name",'Anime Name','theme']]

    name Anime Name                theme
0   Gojo        JJK               Action
1  Sanji   OnePiece  Mistory & Adventure
4  Aizen     Bleach               Bankei

In [ ]:
# CONDITIONAL SELECTION

In [54]:
df2

     name   Anime Name       Ranking                theme
0    Gojo          JJK        NewGen               Action
1   Sanji     OnePiece          Big3  Mistory & Adventure
2  Vegeta  Dragon Ball  Master piece         Action Story
3       L   Death note          None                Crime
4   Aizen       Bleach          Big3               Bankei

In [55]:
df2["Power level"]=[800,850,1000,500,999999]

In [56]:
df2

     name   Anime Name       Ranking                theme  Power level
0    Gojo          JJK        NewGen               Action          800
1   Sanji     OnePiece          Big3  Mistory & Adventure          850
2  Vegeta  Dragon Ball  Master piece         Action Story         1000
3       L   Death note          None                Crime          500
4   Aizen       Bleach          Big3               Bankei       999999

In [57]:
df2[df2["Power level"]>=890]

     name   Anime Name       Ranking         theme  Power level
2  Vegeta  Dragon Ball  Master piece  Action Story         1000
4   Aizen       Bleach          Big3        Bankei       999999

In [58]:
df2[(df2["Power level"]>500) & (df2["Ranking"]=="Big3")]

    name Anime Name Ranking                theme  Power level
1  Sanji   OnePiece    Big3  Mistory & Adventure          850
4  Aizen     Bleach    Big3               Bankei       999999